In [2]:
import pandas as pd
import matplotlib.pyplot as plt

businesses = pd.read_csv('businesses.csv')
categories = pd.read_csv('datasets\\categories.csv')
countries = pd.read_csv('datasets\\countries.csv')
new_businesses = pd.read_csv('datasets\\new_businesses.csv')

# Oldest business by continent

In [19]:
biz_country = businesses.merge(countries, on = "country_code").merge(categories, on = "category_code")
oldest_biz = biz_country.groupby('continent').agg({'year_founded': 'min'})
oldest_biz

               year_founded
continent
Africa                 1772
Asia                    578
Europe                  803
North America          1534
Oceania                1809
South America          1565

# Oldest business in South America

In [40]:
biz_country_category = businesses.merge(countries, on = "country_code").merge(categories, on = "category_code")
s_a = biz_country_category[biz_country_category['continent'] == 'South America']
s_a.sort_values('year_founded', ascending = True).head()[['business', 'year_founded']]

                       business  year_founded
107     Casa Nacional de Moneda          1565
134  Casa de Moneda de Colombia          1621
5                Hacienda Chuao          1660
133     Casa da Moeda do Brasil          1694
147                       Famae          1811

# Oldest category of business in South America

In [36]:
s_a_cat = s_a.groupby('category').agg({'year_founded': 'min'})
s_a_cat

                            year_founded
category
Banking & Finance                   1565
Cafés, Restaurants & Bars           1877
Defense                             1811
Food & Beverages                    1660
Manufacturing & Production          1621

# Missing South America countries from the list

In [61]:
countries_missing = countries.merge(businesses, on = 'country_code', how = 'left', indicator = True)
countries_missing_list = countries_missing[countries_missing['_merge'] != 'both'][['continent', 'country']]
countries_missing_count_sa = countries_missing_list.groupby('continent').agg({'country':'count'})
s_a_missing = countries_missing_list[countries_missing_list['continent'] == 'South America']
s_a_missing_count = countries_missing_count_sa.reset_index()
display(s_a_missing, s_a_missing_count.loc[5]

         continent   country
50   South America   Ecuador
143  South America  Paraguay
160  South America  Suriname

continent    South America
country                  3
Name: 5, dtype: object

# Missing countries from the list

In [72]:
countries_missing = countries.merge(businesses, on = 'country_code', how = 'left', indicator = True)
countries_missing_list = countries_missing[countries_missing['_merge'] != 'both'][['continent', 'country']]
countries_missing_count= countries_missing_list.groupby('continent').agg({'country':'count'})
countries_missing_count

               country
continent
Africa               3
Asia                 7
Europe               2
North America        6
Oceania             11
South America        3

# The oldest companies

In [84]:
from datetime import date
todays_date = date.today()
biz_country_category['operations'] = todays_date.year - biz_country_category['year_founded']
biz_country_category.sort_values('operations', ascending = False).head()[['business', 'country','year_founded','operations']]

                        business         country  year_founded  operations
148                   Kongō Gumi           Japan           578        1444
142  St. Peter Stifts Kulinarium         Austria           803        1219
44         Staffelter Hof Winery         Germany           862        1160
127            Monnaie de Paris           France           864        1158
126               The Royal Mint  United Kingdom           886        1136

# The oldest business categories

In [90]:
biz_country_category['operations'] = todays_date.year - biz_country_category['year_founded']
cat_max = biz_country_category.groupby('category').agg({'operations':'max'}).sort_values('operations', ascending = False).head()
cat_sum = biz_country_category.groupby('category').agg({'operations':'sum'}).sort_values('operations', ascending = False).head()
display(cat_max, cat_sum)

                                   operations
category
Construction                             1444
Cafés, Restaurants & Bars                1219
Distillers, Vintners, & Breweries        1160
Manufacturing & Production               1158
Agriculture                               804

                                   operations
category
Manufacturing & Production               8476
Distillers, Vintners, & Breweries        7192
Banking & Finance                        4512
Cafés, Restaurants & Bars                3600
Postal Service                           3239